docs/prod-readiness/00-command-output/load-smoke-result.txt

         /\      Grafana   /??/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ??\ 
  /          \   |   (  |  (?)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: test/load/smoke-test.js
        output: -

     scenarios: (100.00%) 1 scenario, 5 max VUs, 1m0s max duration (incl. graceful stop):
              * default: 5 looping VUs for 30s (gracefulStop: 30s)


running (0m01.0s), 5/5 VUs, 0 complete and 0 interrupted iterations
default   [   3% ] 5 VUs  01.0s/30s

running (0m02.1s), 5/5 VUs, 5 complete and 0 interrupted iterations
default   [   7% ] 5 VUs  02.1s/30s

running (0m03.0s), 5/5 VUs, 5 complete and 0 interrupted iterations
default   [  10% ] 5 VUs  03.0s/30s

running (0m04.0s), 5/5 VUs, 8 complete and 0 interrupted iterations
default   [  13% ] 5 VUs  04.0s/30s

running (0m05.0s), 5/5 VUs, 10 complete and 0 interrupted iterations
default   [  17% ] 5 VUs  05.0s/30s

running (0m06.0s), 5/5 VUs, 15 complete and 0 interrupted iterations
default   [  20% ] 5 VUs  06.0s/30s

running (0m07.0s), 5/5 VUs, 20 complete and 0 interrupted iterations
default   [  23% ] 5 VUs  07.0s/30s

running (0m08.0s), 5/5 VUs, 22 complete and 0 interrupted iterations
default   [  27% ] 5 VUs  08.0s/30s

running (0m09.0s), 5/5 VUs, 26 complete and 0 interrupted iterations
default   [  30% ] 5 VUs  09.0s/30s

running (0m10.0s), 5/5 VUs, 31 complete and 0 interrupted iterations
default   [  33% ] 5 VUs  10.0s/30s

running (0m11.0s), 5/5 VUs, 35 complete and 0 interrupted iterations
default   [  37% ] 5 VUs  11.0s/30s

running (0m12.0s), 5/5 VUs, 37 complete and 0 interrupted iterations
default   [  40% ] 5 VUs  12.0s/30s

running (0m13.0s), 5/5 VUs, 42 complete and 0 interrupted iterations
default   [  43% ] 5 VUs  13.0s/30s

running (0m14.0s), 5/5 VUs, 47 complete and 0 interrupted iterations
default   [  47% ] 5 VUs  14.0s/30s

running (0m15.0s), 5/5 VUs, 49 complete and 0 interrupted iterations
default   [  50% ] 5 VUs  15.0s/30s

running (0m16.0s), 5/5 VUs, 54 complete and 0 interrupted iterations
default   [  53% ] 5 VUs  16.0s/30s

running (0m17.0s), 5/5 VUs, 58 complete and 0 interrupted iterations
default   [  57% ] 5 VUs  17.0s/30s

running (0m18.0s), 5/5 VUs, 63 complete and 0 interrupted iterations
default   [  60% ] 5 VUs  18.0s/30s

running (0m19.0s), 5/5 VUs, 66 complete and 0 interrupted iterations
default   [  63% ] 5 VUs  19.0s/30s

running (0m20.0s), 5/5 VUs, 70 complete and 0 interrupted iterations
default   [  67% ] 5 VUs  20.0s/30s

running (0m21.0s), 5/5 VUs, 74 complete and 0 interrupted iterations
default   [  70% ] 5 VUs  21.0s/30s

running (0m22.0s), 5/5 VUs, 77 complete and 0 interrupted iterations
default   [  73% ] 5 VUs  22.0s/30s

running (0m23.0s), 5/5 VUs, 81 complete and 0 interrupted iterations
default   [  77% ] 5 VUs  23.0s/30s

running (0m24.0s), 5/5 VUs, 86 complete and 0 interrupted iterations
default   [  80% ] 5 VUs  24.0s/30s

running (0m25.0s), 5/5 VUs, 91 complete and 0 interrupted iterations
default   [  83% ] 5 VUs  25.0s/30s

running (0m26.0s), 5/5 VUs, 95 complete and 0 interrupted iterations
default   [  87% ] 5 VUs  26.0s/30s

running (0m27.0s), 5/5 VUs, 98 complete and 0 interrupted iterations
default   [  90% ] 5 VUs  27.0s/30s

running (0m28.0s), 5/5 VUs, 103 complete and 0 interrupted iterations
default   [  93% ] 5 VUs  28.0s/30s

running (0m29.0s), 5/5 VUs, 108 complete and 0 interrupted iterations
default   [  97% ] 5 VUs  29.0s/30s

running (0m30.0s), 5/5 VUs, 111 complete and 0 interrupted iterations
default   [ 100% ] 5 VUs  30.0s/30s

running (0m31.1s), 3/5 VUs, 113 complete and 0 interrupted iterations
default ? [ 100% ] 5 VUs  30s

running (0m31.4s), 0/5 VUs, 116 complete and 0 interrupted iterations
default ? [ 100% ] 5 VUs  30s

running (0m31.4s), 0/5 VUs, 116 complete and 0 interrupted iterations
default ? [ 100% ] 5 VUs  30s


  ¦ THRESHOLDS 

    address_success
    ? 'rate>0.99' rate=0.00%

    browse_restaurants_success
    ? 'rate>0.99' rate=100.00%

    http_req_duration
    ? 'p(95)<1500' p(95)=613.58ms

    http_req_failed
    ? 'rate<0.01' rate=0.00%

    load_success
    ? 'rate>0.99' rate=100.00%

    login_success
    ? 'rate>0.99' rate=0.00%

    order_success
    ? 'rate>0.99' rate=0.00%

    signup_success
    ? 'rate>0.99' rate=100.00%


  ¦ TOTAL RESULTS 

    checks_total.......: 233     7.431374/s
    checks_succeeded...: 100.00% 233 out of 233
    checks_failed......: 0.00%   0 out of 233

    ? backend health is 200
    ? register status 200/201
    ? browse restaurants status 200

    CUSTOM
    address_success................: 0.00%   0 out of 0
    browse_restaurants_success.....: 100.00% 116 out of 116
    load_success...................: 100.00% 232 out of 232
    login_success..................: 0.00%   0 out of 0
    order_success..................: 0.00%   0 out of 0
    signup_success.................: 100.00% 116 out of 116

    HTTP
    http_req_duration..............: avg=164.61ms min=0s    med=16.44ms max=1.28s p(90)=484.03ms p(95)=613.58ms
      { expected_response:true }...: avg=164.61ms min=0s    med=16.44ms max=1.28s p(90)=484.03ms p(95)=613.58ms
    http_req_failed................: 0.00%   0 out of 233
    http_reqs......................: 233     7.431374/s

    EXECUTION
    iteration_duration.............: avg=1.33s    min=1.11s med=1.23s   max=2.31s p(90)=1.65s    p(95)=1.89s   
    iterations.....................: 116     3.69974/s
    vus............................: 3       min=3          max=5
    vus_max........................: 5       min=5          max=5

    NETWORK
    data_received..................: 290 kB  9.2 kB/s
    data_sent......................: 80 kB   2.5 kB/s



running (0m31.4s), 0/5 VUs, 116 complete and 0 interrupted iterations
default ? [ 100% ] 5 VUs  30s